OFtemplate/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



application     pisoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         150e-4;

deltaT          1.5e-6;

writeControl    timeStep;//adjustableRunTime;

writeInterval   50;//1.5e-5;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;
adjustTimeStep	true;

maxCo		1;
maxAlphaCo	1;

functions
{
    #include "forces"
    #include "forceCoeffs"
}

// ************************************************************************* //
