OFtemplate/0/include/frontBackUpperPatches
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

"(front|back|upperWall|lowerWall)"
{
    type symmetryPlane;
}
// ************************************************************************* //
