OFtemplate/0/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

flowVelocity         (0.0012245 0 0);
pressure             0;
turbulentKE          0.034439;//0.48;//0.24;
turbulentOmega       3;//891.62;//488.36;//2.56;//1.78;
// ************************************************************************* //






















