OFtemplate/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.05;

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           uniform 0.05;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.05;
        value           uniform 0.05;
    }

    model
    {
        type            fixedValue;
        value           uniform 0;
    }

    "(front|back|upperWall|lowerWall)"
    {
        type            symmetryPlane;
    }

    "proc.*"
    {
        type            processor;
    }
}


// ************************************************************************* //
