OFtemplate/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

forceCoeffs1
{
    type            forceCoeffs;
    libs            ("libforces.so");
    writeControl    timeStep;
    timeInterval    1;
    patches         (model);
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1.0;           // Redundant for incompressible
    dragDir         (1 0 0);
    liftDir         (0 0 1);
    origin          (0 0 0);
    CofR            (0 0 0);
    pitchAxis       (1 0 0);
    magUInf         0.002449;
    lRef            0.05;
    Aref            0.0019635;
}
forceCoeffs2
{
    type            forceCoeffs;
    libs            ("libforces.so");
    writeControl    timeStep;
    timeInterval    1;
    patches         (model);
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1.0;           // Redundant for incompressible
    dragDir         (0 1 0);
    liftDir         (0 0 1);
    origin          (0 0 0);
    CofR            (0 0 0);
    pitchAxis       (0 1 0);
    magUInf         0.002449;
    lRef            0.05;
    Aref            0.0019635;
}
forceCoeffs3
{
    type            forceCoeffs;
    libs            ("libforces.so");
    writeControl    timeStep;
    timeInterval    1;
    patches         (model);
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1.0;           // Redundant for incompressible
    dragDir         (0 0 1);
    liftDir         (0 1 0);
    origin          (0 0 0);
    CofR            (0 0 0);
    pitchAxis       (0 0 1);
    magUInf         0.002449;
    lRef            0.05;
    Aref            0.0019635;
}


// ************************************************************************* //





















