OFtemplate/system/forces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

forces
{
    type          forces;

    libs          ("libforces.so");

    writeControl  timeStep;
    timeInterval  1;

    log           yes;

    patches       (model);
    rho           rhoInf;     // Indicates incompressible
    log           true;
    rhoInf        1.225;

    CofR          (0 0 0);
    pitchAxis     (0 1 0);
}


// ************************************************************************* //





















